# EDUNET FOUNDATION - Self-Practice Exercise Notebook

# LAB 7- Python Connection with Database

Problem 1 create a table named EMPLOYEE in MySQL with five columns namely, FIRST_NAME,AGE, SEX and, INCOME.

In [16]:
import sqlite3 as sql
a= sql.connect("a.db")
c = a.cursor()

c.execute("create table EMPLOYEE(FIRST_NAME varchar(25),AGE int, SEX varchar(1), INCOME int)")

Problem 2: Display created table using SELECT

In [17]:
c.execute("INSERT INTO EMPLOYEE values('KARTHIK',21,'M',21000)")
c.execute("SELECT * FROM EMPLOYEE;")
m  = c.fetchall()
for i in m:
    print(i)

('KARTHIK', 21, 'M', 21000)

Problem 3:Write a MySQL statement which retrieves the records of the employees whose income is greater than 4000.

In [18]:
c.execute("INSERT INTO EMPLOYEE values('Arun',21,'M',3000)")
c.execute("INSERT INTO EMPLOYEE values('Varun',21,'M',23000)")
c.execute("SELECT * FROM EMPLOYEE WHERE INCOME > 4000;")
m  = c.fetchall()
for i in m:
    print(i)

('KARTHIK', 21, 'M', 21000)
('Varun', 21, 'M', 23000)